lsp-grammarly.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>问题是好的</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Jason Tian" />
<link rel="stylesheet" type="text/css" href="./css/worg.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><div id="content">
<h1 class="title">问题是好的</h1>
<p>
<span class="timestamp-wrapper"><span class="timestamp">[2022-09-05 Mon 22:48]</span></span> 今天 disable 了 refile targets cache。然后 lsp-grammarly
的问题似乎也好了[doge]……同时我增加了 lsp-mode 的配置，和 3 个 package：lsp-ui，
helm-org-ql 和 lsp-treemacs。ALL THESE MADE MY DAY.[微笑]
</p>

<p>
我也整理了 KeePass 数据库，iOS 上借助 Fantasy Pass 维护管理，一个反手我把其存于坚果云的数据库和 NAS 同步也配了。
</p>

<p>
这还没完，Org 9 的 org-file-apps .mp4 打开的问题我也搞好了，哈哈哈哈哈
</p>

<p>
<span class="timestamp-wrapper"><span class="timestamp">[2022-09-03 Sat 12:45]</span></span> 几个关于 refile cache 的待研究的参考文档
</p>
<ul class="org-ul">
<li><a href="https://web.archive.org/web/20220829071422/https://yiming.dev/blog/2018/03/02/my-org-refile-workflow/">https://web.archive.org/web/20220829071422/https://yiming.dev/blog/2018/03/02/my-org-refile-workflow/</a>
</li>
<li><a href="https://git.entf.net/dotemacs/file/elpa/org-9.5/org-refile.el.html">https://git.entf.net/dotemacs/file/elpa/org-9.5/org-refile.el.html</a>
</li>
</ul>

<p>
<span class="timestamp-wrapper"><span class="timestamp">[2022-09-02 Fri 22:48]</span></span> 我把 refile target 的 maxlevel 从 9 改为了 4，观察一段时间看看，当然我也觉得这不是真正的解决问题的办法。[doge]
</p>

<p>
<span class="timestamp-wrapper"><span class="timestamp">[2022-09-02 Fri 19:01]</span></span> 我今天发现 lsp-grammarly 有点问题，似乎和 projectile 有点关系，然后 refile targets cache 也卡住了……太棒了！
</p>
</div>
<div id="postamble" class="status">
<hr />
<p><a href="//jsntn.com">Jason Tian</a><br /><span class="timestamp-wrapper"><span class="timestamp">&lt;2022-09-02 Fri 19:01&gt;</span></span></p>
</div>
</body>
</html>
